MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS805/mcu.h
extern volatile ADTRIG4LBITS ADTRIG4Lbits __attribute__((__sfr__));

#define ADTRIG4H ADTRIG4H
extern volatile uint16_t ADTRIG4H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG4HBITS {
  union {
    struct {
      uint16_t TRGSRC18:5;
      uint16_t :3;
      uint16_t TRGSRC19:5;
    };
    struct {
      uint16_t TRIGSRC180:1;
      uint16_t TRIGSRC181:1;
      uint16_t TRIGSRC182:1;
      uint16_t TRIGSRC183:1;
      uint16_t TRIGSRC184:1;
      uint16_t :3;
      uint16_t TRGSRC190:1;
      uint16_t TRGSRC191:1;
      uint16_t TRGSRC192:1;
      uint16_t TRGSRC193:1;
      uint16_t TRGSRC194:1;
    };
    struct {
      uint16_t TRGSRC180:1;
      uint16_t TRGSRC181:1;
      uint16_t TRGSRC182:1;
      uint16_t TRGSRC183:1;
      uint16_t TRGSRC184:1;
    };
  };
} ADTRIG4HBITS;
extern volatile ADTRIG4HBITS ADTRIG4Hbits __attribute__((__sfr__));

#define ADTRIG5L ADTRIG5L
extern volatile uint16_t ADTRIG5L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG5LBITS {
  union {
    struct {
      uint16_t TRGSRC20:5;
      uint16_t :3;
      uint16_t TRGSRC21:5;
    };
    struct {
      uint16_t TRIGSRC200:1;
      uint16_t TRIGSRC201:1;
      uint16_t TRIGSRC202:1;
      uint16_t TRIGSRC203:1;
      uint16_t TRIGSRC204:1;
      uint16_t :3;
      uint16_t TRGSRC210:1;
      uint16_t TRGSRC211:1;
      uint16_t TRGSRC212:1;
      uint16_t TRGSRC213:1;
      uint16_t TRGSRC214:1;
    };
    struct {
      uint16_t TRGSRC200:1;
      uint16_t TRGSRC201:1;
      uint16_t TRGSRC202:1;
      uint16_t TRGSRC203:1;
      uint16_t TRGSRC204:1;
    };
  };
} ADTRIG5LBITS;
extern volatile ADTRIG5LBITS ADTRIG5Lbits __attribute__((__sfr__));

#define ADCMP0CON ADCMP0CON
extern volatile uint16_t ADCMP0CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP0CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP0CONBITS;
extern volatile ADCMP0CONBITS ADCMP0CONbits __attribute__((__sfr__));

#define ADCMP1CON ADCMP1CON
extern volatile uint16_t ADCMP1CON __attribute__((__sfr__));
__extension__ typedef struct tagADCMP1CONBITS {
  union {
    struct {
      uint16_t LOLO:1;
      uint16_t LOHI:1;
      uint16_t HILO:1;
      uint16_t HIHI:1;
      uint16_t BTWN:1;
      uint16_t STAT:1;
      uint16_t IE:1;
      uint16_t CMPEN:1;
      uint16_t CHNL:5;
    };
    struct {
      uint16_t :8;
      uint16_t CHNL0:1;
      uint16_t CHNL1:1;
      uint16_t CHNL2:1;
      uint16_t CHNL3:1;
      uint16_t CHNL4:1;
    };
  };
} ADCMP1CONBITS;
extern volatile ADCMP1CONBITS ADCMP1CONbits __attribute__((__sfr__));

#define ADBASE ADBASE
extern volatile uint16_t ADBASE __attribute__((__sfr__));
__extension__ typedef struct tagADBASEBITS {
  union {
    struct {
      uint16_t CHOFFSET:16;
    };
    struct {
      uint16_t CHOFFSET0:1;
      uint16_t CHOFFSET1:1;
      uint16_t CHOFFSET2:1;
      uint16_t CHOFFSET3:1;
      uint16_t CHOFFSET4:1;
      uint16_t CHOFFSET5:1;
      uint16_t CHOFFSET6:1;
      uint16_t CHOFFSET7:1;
      uint16_t CHOFFSET8:1;
      uint16_t CHOFFSET9:1;
      uint16_t CHOFFSET10:1;
      uint16_t CHOFFSET11:1;
      uint16_t CHOFFSET12:1;
      uint16_t CHOFFSET13:1;
      uint16_t CHOFFSET14:1;
      uint16_t CHOFFSET15:1;
    };
  };
} ADBASEBITS;
extern volatile ADBASEBITS ADBASEbits __attribute__((__sfr__));

#define ADLVLTRGL ADLVLTRGL
extern volatile uint16_t ADLVLTRGL __attribute__((__sfr__));
typedef struct tagADLVLTRGLBITS {
  uint16_t LVLEN0:1;
  uint16_t LVLEN1:1;
  uint16_t LVLEN2:1;
  uint16_t LVLEN3:1;
  uint16_t LVLEN4:1;
  uint16_t :1;
  uint16_t LVLEN6:1;
  uint16_t LVLEN7:1;
  uint16_t LVLEN8:1;
  uint16_t LVLEN9:1;
  uint16_t LVLEN10:1;
  uint16_t LVLEN11:1;
  uint16_t :2;
  uint16_t LVLEN14:1;
} ADLVLTRGLBITS;
extern volatile ADLVLTRGLBITS ADLVLTRGLbits __attribute__((__sfr__));

#define ADLVLTRGH ADLVLTRGH
extern volatile uint16_t ADLVLTRGH __attribute__((__sfr__));
typedef struct tagADLVLTRGHBITS {
  uint16_t :1;
  uint16_t LVLEN17:1;
  uint16_t LVLEN18:1;
  uint16_t LVLEN19:1;
  uint16_t LVLEN20:1;
  uint16_t LVLEN21:1;
} ADLVLTRGHBITS;
extern volatile ADLVLTRGHBITS ADLVLTRGHbits __attribute__((__sfr__));

#define ADCORE0L ADCORE0L
extern volatile uint16_t ADCORE0L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE0LBITS;
extern volatile ADCORE0LBITS ADCORE0Lbits __attribute__((__sfr__));

#define ADCORE0H ADCORE0H
extern volatile uint16_t ADCORE0H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE0HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE0HBITS;
extern volatile ADCORE0HBITS ADCORE0Hbits __attribute__((__sfr__));

#define ADCORE1L ADCORE1L
extern volatile uint16_t ADCORE1L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE1LBITS;
extern volatile ADCORE1LBITS ADCORE1Lbits __attribute__((__sfr__));

#define ADCORE1H ADCORE1H
extern volatile uint16_t ADCORE1H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE1HBITS;
extern volatile ADCORE1HBITS ADCORE1Hbits __attribute__((__sfr__));

#define ADCORE2L ADCORE2L
extern volatile uint16_t ADCORE2L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE2LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE2LBITS;
extern volatile ADCORE2LBITS ADCORE2Lbits __attribute__((__sfr__));

#define ADCORE2H ADCORE2H
extern volatile uint16_t ADCORE2H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE2HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE2HBITS;
extern volatile ADCORE2HBITS ADCORE2Hbits __attribute__((__sfr__));

#define ADCORE3L ADCORE3L
extern volatile uint16_t ADCORE3L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE3LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE3LBITS;
extern volatile ADCORE3LBITS ADCORE3Lbits __attribute__((__sfr__));

