MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS805/mcu.h
#define _I2C1CONL_RCEN_POSITION                  0x00000003
#define _I2C1CONL_RCEN_MASK                      0x00000008
#define _I2C1CONL_RCEN_LENGTH                    0x00000001

#define _I2C1CONL_ACKEN_POSITION                 0x00000004
#define _I2C1CONL_ACKEN_MASK                     0x00000010
#define _I2C1CONL_ACKEN_LENGTH                   0x00000001

#define _I2C1CONL_ACKDT_POSITION                 0x00000005
#define _I2C1CONL_ACKDT_MASK                     0x00000020
#define _I2C1CONL_ACKDT_LENGTH                   0x00000001

#define _I2C1CONL_STREN_POSITION                 0x00000006
#define _I2C1CONL_STREN_MASK                     0x00000040
#define _I2C1CONL_STREN_LENGTH                   0x00000001

#define _I2C1CONL_GCEN_POSITION                  0x00000007
#define _I2C1CONL_GCEN_MASK                      0x00000080
#define _I2C1CONL_GCEN_LENGTH                    0x00000001

#define _I2C1CONL_SMEN_POSITION                  0x00000008
#define _I2C1CONL_SMEN_MASK                      0x00000100
#define _I2C1CONL_SMEN_LENGTH                    0x00000001

#define _I2C1CONL_DISSLW_POSITION                0x00000009
#define _I2C1CONL_DISSLW_MASK                    0x00000200
#define _I2C1CONL_DISSLW_LENGTH                  0x00000001

#define _I2C1CONL_A10M_POSITION                  0x0000000A
#define _I2C1CONL_A10M_MASK                      0x00000400
#define _I2C1CONL_A10M_LENGTH                    0x00000001

#define _I2C1CONL_STRICT_POSITION                0x0000000B
#define _I2C1CONL_STRICT_MASK                    0x00000800
#define _I2C1CONL_STRICT_LENGTH                  0x00000001

#define _I2C1CONL_SCLREL_POSITION                0x0000000C
#define _I2C1CONL_SCLREL_MASK                    0x00001000
#define _I2C1CONL_SCLREL_LENGTH                  0x00000001

#define _I2C1CONL_I2CSIDL_POSITION               0x0000000D
#define _I2C1CONL_I2CSIDL_MASK                   0x00002000
#define _I2C1CONL_I2CSIDL_LENGTH                 0x00000001

#define _I2C1CONL_I2CEN_POSITION                 0x0000000F
#define _I2C1CONL_I2CEN_MASK                     0x00008000
#define _I2C1CONL_I2CEN_LENGTH                   0x00000001

#define _I2C1CON2_DHEN_POSITION                  0x00000000
#define _I2C1CON2_DHEN_MASK                      0x00000001
#define _I2C1CON2_DHEN_LENGTH                    0x00000001

#define _I2C1CON2_AHEN_POSITION                  0x00000001
#define _I2C1CON2_AHEN_MASK                      0x00000002
#define _I2C1CON2_AHEN_LENGTH                    0x00000001

#define _I2C1CON2_SBCDE_POSITION                 0x00000002
#define _I2C1CON2_SBCDE_MASK                     0x00000004
#define _I2C1CON2_SBCDE_LENGTH                   0x00000001

#define _I2C1CON2_SDAHT_POSITION                 0x00000003
#define _I2C1CON2_SDAHT_MASK                     0x00000008
#define _I2C1CON2_SDAHT_LENGTH                   0x00000001

#define _I2C1CON2_BOEN_POSITION                  0x00000004
#define _I2C1CON2_BOEN_MASK                      0x00000010
#define _I2C1CON2_BOEN_LENGTH                    0x00000001

#define _I2C1CON2_SCIE_POSITION                  0x00000005
#define _I2C1CON2_SCIE_MASK                      0x00000020
#define _I2C1CON2_SCIE_LENGTH                    0x00000001

#define _I2C1CON2_PCIE_POSITION                  0x00000006
#define _I2C1CON2_PCIE_MASK                      0x00000040
#define _I2C1CON2_PCIE_LENGTH                    0x00000001

#define _I2C1CONH_DHEN_POSITION                  0x00000000
#define _I2C1CONH_DHEN_MASK                      0x00000001
#define _I2C1CONH_DHEN_LENGTH                    0x00000001

#define _I2C1CONH_AHEN_POSITION                  0x00000001
#define _I2C1CONH_AHEN_MASK                      0x00000002
#define _I2C1CONH_AHEN_LENGTH                    0x00000001

#define _I2C1CONH_SBCDE_POSITION                 0x00000002
#define _I2C1CONH_SBCDE_MASK                     0x00000004
#define _I2C1CONH_SBCDE_LENGTH                   0x00000001

#define _I2C1CONH_SDAHT_POSITION                 0x00000003
#define _I2C1CONH_SDAHT_MASK                     0x00000008
#define _I2C1CONH_SDAHT_LENGTH                   0x00000001

#define _I2C1CONH_BOEN_POSITION                  0x00000004
#define _I2C1CONH_BOEN_MASK                      0x00000010
#define _I2C1CONH_BOEN_LENGTH                    0x00000001

#define _I2C1CONH_SCIE_POSITION                  0x00000005
#define _I2C1CONH_SCIE_MASK                      0x00000020
#define _I2C1CONH_SCIE_LENGTH                    0x00000001

#define _I2C1CONH_PCIE_POSITION                  0x00000006
#define _I2C1CONH_PCIE_MASK                      0x00000040
#define _I2C1CONH_PCIE_LENGTH                    0x00000001

#define _I2C1STAT_TBF_POSITION                   0x00000000
#define _I2C1STAT_TBF_MASK                       0x00000001
#define _I2C1STAT_TBF_LENGTH                     0x00000001

#define _I2C1STAT_RBF_POSITION                   0x00000001
#define _I2C1STAT_RBF_MASK                       0x00000002
#define _I2C1STAT_RBF_LENGTH                     0x00000001

#define _I2C1STAT_R_W_POSITION                   0x00000002
#define _I2C1STAT_R_W_MASK                       0x00000004
#define _I2C1STAT_R_W_LENGTH                     0x00000001

#define _I2C1STAT_S_POSITION                     0x00000003
#define _I2C1STAT_S_MASK                         0x00000008
#define _I2C1STAT_S_LENGTH                       0x00000001

#define _I2C1STAT_P_POSITION                     0x00000004
#define _I2C1STAT_P_MASK                         0x00000010
#define _I2C1STAT_P_LENGTH                       0x00000001

#define _I2C1STAT_D_A_POSITION                   0x00000005
#define _I2C1STAT_D_A_MASK                       0x00000020
#define _I2C1STAT_D_A_LENGTH                     0x00000001

#define _I2C1STAT_I2COV_POSITION                 0x00000006
#define _I2C1STAT_I2COV_MASK                     0x00000040
#define _I2C1STAT_I2COV_LENGTH                   0x00000001

#define _I2C1STAT_IWCOL_POSITION                 0x00000007
#define _I2C1STAT_IWCOL_MASK                     0x00000080
#define _I2C1STAT_IWCOL_LENGTH                   0x00000001

