MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS805/mcu.h
#define _ADTRIG4H_TRGSRC193_POSITION             0x0000000B
#define _ADTRIG4H_TRGSRC193_MASK                 0x00000800
#define _ADTRIG4H_TRGSRC193_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC194_POSITION             0x0000000C
#define _ADTRIG4H_TRGSRC194_MASK                 0x00001000
#define _ADTRIG4H_TRGSRC194_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC180_POSITION             0x00000000
#define _ADTRIG4H_TRGSRC180_MASK                 0x00000001
#define _ADTRIG4H_TRGSRC180_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC181_POSITION             0x00000001
#define _ADTRIG4H_TRGSRC181_MASK                 0x00000002
#define _ADTRIG4H_TRGSRC181_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC182_POSITION             0x00000002
#define _ADTRIG4H_TRGSRC182_MASK                 0x00000004
#define _ADTRIG4H_TRGSRC182_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC183_POSITION             0x00000003
#define _ADTRIG4H_TRGSRC183_MASK                 0x00000008
#define _ADTRIG4H_TRGSRC183_LENGTH               0x00000001

#define _ADTRIG4H_TRGSRC184_POSITION             0x00000004
#define _ADTRIG4H_TRGSRC184_MASK                 0x00000010
#define _ADTRIG4H_TRGSRC184_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC20_POSITION              0x00000000
#define _ADTRIG5L_TRGSRC20_MASK                  0x0000001F
#define _ADTRIG5L_TRGSRC20_LENGTH                0x00000005

#define _ADTRIG5L_TRGSRC21_POSITION              0x00000008
#define _ADTRIG5L_TRGSRC21_MASK                  0x00001F00
#define _ADTRIG5L_TRGSRC21_LENGTH                0x00000005

#define _ADTRIG5L_TRIGSRC200_POSITION            0x00000000
#define _ADTRIG5L_TRIGSRC200_MASK                0x00000001
#define _ADTRIG5L_TRIGSRC200_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC201_POSITION            0x00000001
#define _ADTRIG5L_TRIGSRC201_MASK                0x00000002
#define _ADTRIG5L_TRIGSRC201_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC202_POSITION            0x00000002
#define _ADTRIG5L_TRIGSRC202_MASK                0x00000004
#define _ADTRIG5L_TRIGSRC202_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC203_POSITION            0x00000003
#define _ADTRIG5L_TRIGSRC203_MASK                0x00000008
#define _ADTRIG5L_TRIGSRC203_LENGTH              0x00000001

#define _ADTRIG5L_TRIGSRC204_POSITION            0x00000004
#define _ADTRIG5L_TRIGSRC204_MASK                0x00000010
#define _ADTRIG5L_TRIGSRC204_LENGTH              0x00000001

#define _ADTRIG5L_TRGSRC210_POSITION             0x00000008
#define _ADTRIG5L_TRGSRC210_MASK                 0x00000100
#define _ADTRIG5L_TRGSRC210_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC211_POSITION             0x00000009
#define _ADTRIG5L_TRGSRC211_MASK                 0x00000200
#define _ADTRIG5L_TRGSRC211_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC212_POSITION             0x0000000A
#define _ADTRIG5L_TRGSRC212_MASK                 0x00000400
#define _ADTRIG5L_TRGSRC212_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC213_POSITION             0x0000000B
#define _ADTRIG5L_TRGSRC213_MASK                 0x00000800
#define _ADTRIG5L_TRGSRC213_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC214_POSITION             0x0000000C
#define _ADTRIG5L_TRGSRC214_MASK                 0x00001000
#define _ADTRIG5L_TRGSRC214_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC200_POSITION             0x00000000
#define _ADTRIG5L_TRGSRC200_MASK                 0x00000001
#define _ADTRIG5L_TRGSRC200_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC201_POSITION             0x00000001
#define _ADTRIG5L_TRGSRC201_MASK                 0x00000002
#define _ADTRIG5L_TRGSRC201_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC202_POSITION             0x00000002
#define _ADTRIG5L_TRGSRC202_MASK                 0x00000004
#define _ADTRIG5L_TRGSRC202_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC203_POSITION             0x00000003
#define _ADTRIG5L_TRGSRC203_MASK                 0x00000008
#define _ADTRIG5L_TRGSRC203_LENGTH               0x00000001

#define _ADTRIG5L_TRGSRC204_POSITION             0x00000004
#define _ADTRIG5L_TRGSRC204_MASK                 0x00000010
#define _ADTRIG5L_TRGSRC204_LENGTH               0x00000001

#define _ADCMP0CON_LOLO_POSITION                 0x00000000
#define _ADCMP0CON_LOLO_MASK                     0x00000001
#define _ADCMP0CON_LOLO_LENGTH                   0x00000001

#define _ADCMP0CON_LOHI_POSITION                 0x00000001
#define _ADCMP0CON_LOHI_MASK                     0x00000002
#define _ADCMP0CON_LOHI_LENGTH                   0x00000001

#define _ADCMP0CON_HILO_POSITION                 0x00000002
#define _ADCMP0CON_HILO_MASK                     0x00000004
#define _ADCMP0CON_HILO_LENGTH                   0x00000001

#define _ADCMP0CON_HIHI_POSITION                 0x00000003
#define _ADCMP0CON_HIHI_MASK                     0x00000008
#define _ADCMP0CON_HIHI_LENGTH                   0x00000001

#define _ADCMP0CON_BTWN_POSITION                 0x00000004
#define _ADCMP0CON_BTWN_MASK                     0x00000010
#define _ADCMP0CON_BTWN_LENGTH                   0x00000001

#define _ADCMP0CON_STAT_POSITION                 0x00000005
#define _ADCMP0CON_STAT_MASK                     0x00000020
#define _ADCMP0CON_STAT_LENGTH                   0x00000001

#define _ADCMP0CON_IE_POSITION                   0x00000006
#define _ADCMP0CON_IE_MASK                       0x00000040
#define _ADCMP0CON_IE_LENGTH                     0x00000001

#define _ADCMP0CON_CMPEN_POSITION                0x00000007
#define _ADCMP0CON_CMPEN_MASK                    0x00000080
#define _ADCMP0CON_CMPEN_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL_POSITION                 0x00000008
#define _ADCMP0CON_CHNL_MASK                     0x00001F00
#define _ADCMP0CON_CHNL_LENGTH                   0x00000005

#define _ADCMP0CON_CHNL0_POSITION                0x00000008
#define _ADCMP0CON_CHNL0_MASK                    0x00000100
#define _ADCMP0CON_CHNL0_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL1_POSITION                0x00000009
#define _ADCMP0CON_CHNL1_MASK                    0x00000200
#define _ADCMP0CON_CHNL1_LENGTH                  0x00000001

#define _ADCMP0CON_CHNL2_POSITION                0x0000000A
#define _ADCMP0CON_CHNL2_MASK                    0x00000400
#define _ADCMP0CON_CHNL2_LENGTH                  0x00000001

