MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS805/mcu.h
#define _IPC26_CMP3IP0_POSITION                  0x00000000
#define _IPC26_CMP3IP0_MASK                      0x00000001
#define _IPC26_CMP3IP0_LENGTH                    0x00000001

#define _IPC26_CMP3IP1_POSITION                  0x00000001
#define _IPC26_CMP3IP1_MASK                      0x00000002
#define _IPC26_CMP3IP1_LENGTH                    0x00000001

#define _IPC26_CMP3IP2_POSITION                  0x00000002
#define _IPC26_CMP3IP2_MASK                      0x00000004
#define _IPC26_CMP3IP2_LENGTH                    0x00000001

#define _IPC26_CMP4IP0_POSITION                  0x00000004
#define _IPC26_CMP4IP0_MASK                      0x00000010
#define _IPC26_CMP4IP0_LENGTH                    0x00000001

#define _IPC26_CMP4IP1_POSITION                  0x00000005
#define _IPC26_CMP4IP1_MASK                      0x00000020
#define _IPC26_CMP4IP1_LENGTH                    0x00000001

#define _IPC26_CMP4IP2_POSITION                  0x00000006
#define _IPC26_CMP4IP2_MASK                      0x00000040
#define _IPC26_CMP4IP2_LENGTH                    0x00000001

#define _IPC27_ADCAN0IP_POSITION                 0x00000008
#define _IPC27_ADCAN0IP_MASK                     0x00000700
#define _IPC27_ADCAN0IP_LENGTH                   0x00000003

#define _IPC27_ADCAN1IP_POSITION                 0x0000000C
#define _IPC27_ADCAN1IP_MASK                     0x00007000
#define _IPC27_ADCAN1IP_LENGTH                   0x00000003

#define _IPC27_ADCAN0IP0_POSITION                0x00000008
#define _IPC27_ADCAN0IP0_MASK                    0x00000100
#define _IPC27_ADCAN0IP0_LENGTH                  0x00000001

#define _IPC27_ADCAN0IP1_POSITION                0x00000009
#define _IPC27_ADCAN0IP1_MASK                    0x00000200
#define _IPC27_ADCAN0IP1_LENGTH                  0x00000001

#define _IPC27_ADCAN0IP2_POSITION                0x0000000A
#define _IPC27_ADCAN0IP2_MASK                    0x00000400
#define _IPC27_ADCAN0IP2_LENGTH                  0x00000001

#define _IPC27_ADCAN1IP0_POSITION                0x0000000C
#define _IPC27_ADCAN1IP0_MASK                    0x00001000
#define _IPC27_ADCAN1IP0_LENGTH                  0x00000001

#define _IPC27_ADCAN1IP1_POSITION                0x0000000D
#define _IPC27_ADCAN1IP1_MASK                    0x00002000
#define _IPC27_ADCAN1IP1_LENGTH                  0x00000001

#define _IPC27_ADCAN1IP2_POSITION                0x0000000E
#define _IPC27_ADCAN1IP2_MASK                    0x00004000
#define _IPC27_ADCAN1IP2_LENGTH                  0x00000001

#define _IPC28_ADCAN2IP_POSITION                 0x00000000
#define _IPC28_ADCAN2IP_MASK                     0x00000007
#define _IPC28_ADCAN2IP_LENGTH                   0x00000003

#define _IPC28_ADCAN3IP_POSITION                 0x00000004
#define _IPC28_ADCAN3IP_MASK                     0x00000070
#define _IPC28_ADCAN3IP_LENGTH                   0x00000003

#define _IPC28_ADCAN4IP_POSITION                 0x00000008
#define _IPC28_ADCAN4IP_MASK                     0x00000700
#define _IPC28_ADCAN4IP_LENGTH                   0x00000003

#define _IPC28_ADCAN2IP0_POSITION                0x00000000
#define _IPC28_ADCAN2IP0_MASK                    0x00000001
#define _IPC28_ADCAN2IP0_LENGTH                  0x00000001

#define _IPC28_ADCAN2IP1_POSITION                0x00000001
#define _IPC28_ADCAN2IP1_MASK                    0x00000002
#define _IPC28_ADCAN2IP1_LENGTH                  0x00000001

#define _IPC28_ADCAN2IP2_POSITION                0x00000002
#define _IPC28_ADCAN2IP2_MASK                    0x00000004
#define _IPC28_ADCAN2IP2_LENGTH                  0x00000001

#define _IPC28_ADCAN3IP0_POSITION                0x00000004
#define _IPC28_ADCAN3IP0_MASK                    0x00000010
#define _IPC28_ADCAN3IP0_LENGTH                  0x00000001

#define _IPC28_ADCAN3IP1_POSITION                0x00000005
#define _IPC28_ADCAN3IP1_MASK                    0x00000020
#define _IPC28_ADCAN3IP1_LENGTH                  0x00000001

#define _IPC28_ADCAN3IP2_POSITION                0x00000006
#define _IPC28_ADCAN3IP2_MASK                    0x00000040
#define _IPC28_ADCAN3IP2_LENGTH                  0x00000001

#define _IPC28_ADCAN4IP0_POSITION                0x00000008
#define _IPC28_ADCAN4IP0_MASK                    0x00000100
#define _IPC28_ADCAN4IP0_LENGTH                  0x00000001

#define _IPC28_ADCAN4IP1_POSITION                0x00000009
#define _IPC28_ADCAN4IP1_MASK                    0x00000200
#define _IPC28_ADCAN4IP1_LENGTH                  0x00000001

#define _IPC28_ADCAN4IP2_POSITION                0x0000000A
#define _IPC28_ADCAN4IP2_MASK                    0x00000400
#define _IPC28_ADCAN4IP2_LENGTH                  0x00000001

#define _IPC29_ADCAN6IP_POSITION                 0x00000000
#define _IPC29_ADCAN6IP_MASK                     0x00000007
#define _IPC29_ADCAN6IP_LENGTH                   0x00000003

#define _IPC29_ADCAN7IP_POSITION                 0x00000004
#define _IPC29_ADCAN7IP_MASK                     0x00000070
#define _IPC29_ADCAN7IP_LENGTH                   0x00000003

#define _IPC29_ADCAN6IP0_POSITION                0x00000000
#define _IPC29_ADCAN6IP0_MASK                    0x00000001
#define _IPC29_ADCAN6IP0_LENGTH                  0x00000001

#define _IPC29_ADCAN6IP1_POSITION                0x00000001
#define _IPC29_ADCAN6IP1_MASK                    0x00000002
#define _IPC29_ADCAN6IP1_LENGTH                  0x00000001

#define _IPC29_ADCAN6IP2_POSITION                0x00000002
#define _IPC29_ADCAN6IP2_MASK                    0x00000004
#define _IPC29_ADCAN6IP2_LENGTH                  0x00000001

#define _IPC29_ADCAN7IP0_POSITION                0x00000004
#define _IPC29_ADCAN7IP0_MASK                    0x00000010
#define _IPC29_ADCAN7IP0_LENGTH                  0x00000001

#define _IPC29_ADCAN7IP1_POSITION                0x00000005
#define _IPC29_ADCAN7IP1_MASK                    0x00000020
#define _IPC29_ADCAN7IP1_LENGTH                  0x00000001

#define _IPC29_ADCAN7IP2_POSITION                0x00000006
#define _IPC29_ADCAN7IP2_MASK                    0x00000040
#define _IPC29_ADCAN7IP2_LENGTH                  0x00000001

#define _IPC31_SPI1EIP_POSITION                  0x00000000
#define _IPC31_SPI1EIP_MASK                      0x00000007
#define _IPC31_SPI1EIP_LENGTH                    0x00000003

#define _IPC31_SPI2EIP_POSITION                  0x00000004
#define _IPC31_SPI2EIP_MASK                      0x00000070
#define _IPC31_SPI2EIP_LENGTH                    0x00000003

